tutorials/fluids/damBreak/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Create the mesh
runApplication blockMesh

# Assign the water region in the alpha field
runApplication setFields

# Run the solver
runApplication solids4Foam

# ----------------------------------------------------------------- end-of-file

